{
    "uuid": "9abd6cc8-9deb-4fd8-ac1f-782130f69b85",
    "type": "Exam",
    "title": "R exam including autograded and manually graded questions",
    "set": "Exam",
    "number": "4",
    "allowAccess": [
        {
            "comment": "students will have access to this timed exam, but will not be able to see their scores or questions once the exam is completed",
            "mode": "Public",
            "credit": 100,
            "timeLimitMin": 3,
            "startDate": "2021-01-01T00:00:01",
            "endDate": "2323-11-07T23:59:59",
            "showClosedAssessment": false,
            "showClosedAssessmentScore": false
       },
       {
           "comment": "students will have access to their final total score at a later time, after all the questions are manually graded and scores are uploaded",
           "mode": "Public",
           "credit": 0,
           "startDate": "2323-11-08T00:00:00",
           "endDate": "2323-11-15T23:59:59",
           "showClosedAssessment": false
      }
    ],
    "zones": [
      {
          "title": "Auto-graded questions",
          "questions": [
            {"id": "exam/autoR/cancerCellsPlotKNN", "points":[3,1]},
            {"id": "exam/autoR/regionCheapestAvocados", "points":[5,4,3,2,1]}
          ]
      },
      {
          "title": "Manually graded questions",
          "questions": [
            {"id": "exam/manualR/describeGitAndGitHub", "points":3},
            {"id": "exam/manualR/hockeyBoxscores", "points": 1}
          ]
      }
    ],
    "text": "<p><strong>Comments about this assessment:</strong> </p><p> The auto-graded questions are graded as students complete the assessment, allowing them to see their scores immediately and retry some of the questions when points are still available.</p> <p> Students can save the manually graded question as they complete the assessment. Instructors will later download the submission files, assign grades, and upload back the scores and feedback. </p><p> The assessment will be closed when the time limit expires (here set to 3 minutes), or once students click the 'Finish assessment' button. Students will not be able to see their total score after the assessment is closed. An additional access rule can be used to allow students to see their total score once all the questions are graded.</p>"
}
